listinput = list(map(int, input().split()))
print(*listinput[::-1])

# Выведите элементы данного списка в обратном порядке, не изменяя сам список (ну не изменился же он).
# Вводится список чисел. Все числа списка находятся на одной строке.
