for i in range(1, 10):
    for j in range(0, 10):
        if i * j * 2 == i * 10 + j:
            print(i, j, sep='')


# Найдите и выведите все двузначные числа, которые равны удвоенному произведению своих цифр.
# Программа не требует ввода данных с клавиатуры, просто выводит список искомых чисел.
