inputlist = list(map(int, input().split()))
positive = [e for e in inputlist if e > 0]
print(len(positive))

# Найдите количество положительных элементов в данном списке.
# Вводится список чисел. Все числа списка находятся на одной строке.
