n = int(input())
m = str()
for i in range(n):
    a = int(input())
    if a == 0:
        m += str(a)
print(len(m))

# Дано несколько чисел. Подсчитайте, сколько из них равны нулю, и выведите это количество.

# Cначала вводится число N, затем вводится ровно N целых чисел.
