n = int(input())
for i in range(10**n - 1, 10**(n - 1) - 1, -2):
    print(i, end=' ')

# Дано натуральное число n. Напечатайте все n-значные нечетные натуральные числа в порядке убывания.
# n = 1 - однозначные
# n = 2 - двузначные
