print(
    any(
        map(
            lambda x: int(input()) == 0,
            range(int(input()))
        )
    )
)
# Вводится число N, а затем N чисел.
#
# Формат вывода
#
# Выведите True, если среди введенных чисел есть хотя бы один нуль, или False в противном случае.

# 7
# 0
# 20
# 9
# 14
# 5
# 29
# 4
# Вывод программы:
# True
